garyPenhook/PIC-Assembler/edc/PIC18F24Q10.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="18xxxx" edc:clonedfrom="PIC18F24K40" edc:desc="" edc:dosid="03158" edc:dsid="DS40001945" edc:hasfreeze="true" edc:informedby="PS DS DOS" edc:masksetid="KFAB" edc:name="PIC18F24Q10" edc:procid="0xA2A6" edc:psid="DS40001874" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:isextended="true">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Import/>
  <edc:Power edc:hashighvoltagemclr="true" edc:hashighvoltagemclr2="true">
    <edc:VPP edc:defaultvoltage="9.000" edc:maxvoltage="9.000" edc:minvoltage="7.900"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="1.800" edc:minvoltage="1.800" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:erasepagesize="128" edc:haslvp="true" edc:haslvp2="true" edc:hasrowerasecmd="true" edc:hasvppfirst="true" edc:lvpthresh="2.100" edc:memtech="ee" edc:pagesize="1" edc:panelsize="0x0" edc:tries="1">
    <edc:ProgrammingWaitTime edc:progop="lverase" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="lvpgm" edc:time="65" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="65535" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="65" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="65" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="eedata" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="userid" edc:time="65" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="rowerase" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="128" edc:progop="rowerase"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="eedata"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="userid"/>
    <edc:Wait edc:lverase="11000" edc:lvpgm="65" edc:erase="65535" edc:pgm="65" edc:cfg="65" edc:eedata="11000" edc:userid="65" edc:rowerase="11000"/>
    <edc:Latches edc:rowerase="128" edc:pgm="1" edc:cfg="1" edc:eedata="1" edc:userid="1"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="18xxxx" edc:name="18xxxx">
    <edc:MemTraits edc:bankcount="16" edc:hwstackdepth="31">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigWORMMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0x000000"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="egg"/>
  <edc:Oscillator/>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x3" edc:idbyte="r"/>
  <edc:Freeze edc:addr="0xFF0">
    <edc:FreezeBit edc:freezeval="1" edc:pos="6"/>
  </edc:Freeze>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x004000" edc:regionid="page"/>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x200100" edc:regionid="testmem1"/>
    <edc:TestZone edc:beginaddr="0x200400" edc:endaddr="0x200800" edc:regionid="testmem2"/>
    <edc:UserIDSector edc:beginaddr="0x200000" edc:endaddr="0x200100" edc:regionid="idlocs"/>
    <edc:ConfigFuseSector edc:beginaddr="0x300000" edc:endaddr="0x30000C" edc:regionid="config">
      <edc:DCRDef edc:access="-nnn-nnn" edc:cname="CONFIG1L" edc:desc="" edc:factorydefault="0xff" edc:impl="0x77" edc:name="CONFIG1L" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x77" edc:default="0xff" edc:_addr="0x300000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FEXTOSC" edc:desc="External Oscillator mode Selection bits" edc:mask="0x7" edc:name="FEXTOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="LP (crystal oscillator) optimized for 32.768 kHz; PFM set to low power" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT (crystal oscillator) above 100 kHz, below 8 MHz; PFM set to medium power" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS (crystal oscillator) above 8 MHz; PFM set to high power" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved (DO NOT USE)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Oscillator not enabled" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="ECL" edc:desc="EC (external clock) below 100 kHz; PFM set to low power" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="ECM" edc:desc="EC (external clock) for 500 kHz to 8 MHz; PFM set to medium power" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="ECH" edc:desc="EC (external clock) above 8 MHz; PFM set to high power" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="RSTOSC" edc:desc="Power-up default value for COSC bits" edc:mask="0x7" edc:name="RSTOSC" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="HFINTOSC_64MHZ" edc:desc="HFINTOSC with HFFRQ = 64 MHz and CDIV = 1:1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="RESERVED_1" edc:desc="Reserved (DO NOT USE)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EXTOSC_4PLL" edc:desc="EXTOSC with 4x PLL, with EXTOSC operating per FEXTOSC bits" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="RESERVED_2" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="LFINTOSC" edc:desc="Low-Frequency Oscillator" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="HFINTOSC_1MHZ" edc:desc="HFINTOSC with HFFRQ = 4 MHz and CDIV = 4:1" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="EXTOSC" edc:desc="EXTOSC operating per FEXTOSC bits (device manufacturing default)" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--n-n--n" edc:cname="CONFIG1H" edc:desc="" edc:factorydefault="0xFF" edc:impl="0x29" edc:name="CONFIG1H" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x29" edc:default="0xFF" edc:_addr="0x300001">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CLKOUTEN" edc:desc="Clock Out Enable bit" edc:mask="0x1" edc:name="CLKOUTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="CLKOUT function is disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="CLKOUT function is enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="CSWEN" edc:desc="Clock Switch Enable bit" edc:mask="0x1" edc:name="CSWEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="The NOSC and NDIV bits cannot be changed by user software" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Writing to NOSC and NDIV is allowed" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="FCMEN" edc:desc="Fail-Safe Clock Monitor Enable bit" edc:mask="0x1" edc:name="FCMEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Fail-Safe Clock Monitor disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Fail-Safe Clock Monitor enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnn---nn" edc:cname="CONFIG2L" edc:desc="" edc:factorydefault="0xFF" edc:impl="0xE3" edc:name="CONFIG2L" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xE3" edc:default="0xFF" edc:_addr="0x300002">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="Master Clear Enable bit" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="EXTMCLR" edc:desc="MCLR pin (RE3) is MCLR" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="INTMCLR" edc:desc="If LVP = 0, MCLR pin (RE3) is an input; If LVP =1, MCLR pin (RE3) is MCLR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PWRTE" edc:desc="Power-up Timer Enable bit" edc:mask="0x1" edc:name="PWRTE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Power up timer enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Power up timer disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="LPBOREN" edc:desc="Low-power BOR enable bit" edc:mask="0x1" edc:name="LPBOREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Low power BOR is disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Low power BOR is enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Reset Enable bits" edc:mask="0x3" edc:name="BOREN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="SBORDIS" edc:desc="Brown-out Reset enabled , SBOREN bit is ignored" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="NOSLP" edc:desc="Brown-out Reset enabled while running, disabled in Sleep; SBOREN is ignored" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Brown-out Reset enabled according to SBOREN" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Brown-out Reset disabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n-nnnnnn" edc:cname="CONFIG2H" edc:desc="" edc:factorydefault="0xFF" edc:impl="0xbf" edc:name="CONFIG2H" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xBF" edc:default="0xFF" edc:_addr="0x300003">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BORV" edc:desc="Brown Out Reset Voltage selection bits" edc:mask="0x3" edc:name="BORV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="VBOR_190" edc:desc="Brown-out Reset Voltage (VBOR) set to 1.90V" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="VBOR_245" edc:desc="Brown-out Reset Voltage (VBOR) set to 2.45V" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="VBOR_270" edc:desc="Brown-out Reset Voltage (VBOR) set to 2.70V" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="VBOR_285" edc:desc="Brown-out Reset Voltage (VBOR) set to 2.85V" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ZCD" edc:desc="ZCD Disable bit" edc:mask="0x1" edc:name="ZCD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="ZCD disabled. ZCD can be enabled by setting the ZCDSEN bit of ZCDCON" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="ZCD always enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PPS1WAY" edc:desc="PPSLOCK bit One-Way Set Enable bit" edc:mask="0x1" edc:name="PPS1WAY" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PPSLOCK bit can be cleared and set only once; PPS registers remain locked after one clear/set cycle" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PPSLOCK bit can be set and cleared repeatedly (subject to the unlock sequence)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="STVREN" edc:desc="Stack Full/Underflow Reset Enable bit" edc:mask="0x1" edc:name="STVREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Stack full/underflow will cause Reset" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Stack full/underflow will not cause Reset" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Debugger Enable bit" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="DEBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Background debugger disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Background debugger enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="XINST" edc:desc="Extended Instruction Set Enable bit" edc:mask="0x1" edc:name="XINST" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Extended Instruction Set and Indexed Addressing Mode disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Extended Instruction Set and Indexed Addressing Mode enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-nnnnnnn" edc:cname="CONFIG3L" edc:desc="" edc:factorydefault="0xff" edc:impl="0x7f" edc:name="CONFIG3L" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x7F" edc:default="0xff" edc:_addr="0x300004">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTCPS" edc:desc="WDT Period Select bits" edc:mask="0x1f" edc:name="WDTCPS" edc:nzwidth="5">
              <edc:DCRFieldSemantic edc:cname="WDTCPS_0" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_1" edc:desc="Divider ratio 1:64" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_2" edc:desc="Divider ratio 1:128" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_3" edc:desc="Divider ratio 1:256" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_4" edc:desc="Divider ratio 1:512" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_5" edc:desc="Divider ratio 1:1024" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_6" edc:desc="Divider ratio 1:2048" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_7" edc:desc="Divider ratio 1:4096" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_8" edc:desc="Divider ratio 1:8192" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_9" edc:desc="Divider ratio 1:16384" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_10" edc:desc="Divider ratio 1:32768" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_11" edc:desc="Divider ratio 1:65536" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_12" edc:desc="Divider ratio 1:131072" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_13" edc:desc="Divider ratio 1:262144" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_14" edc:desc="Divider ratio 1:524299" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_15" edc:desc="Divider ratio 1:1048576" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_16" edc:desc="Divider ratio 1:2097152" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_17" edc:desc="Divider ratio 1:4194304" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_18" edc:desc="Divider ratio 1:8388608" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_19" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_20" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_21" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_22" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_23" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_24" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_25" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_26" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_27" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_28" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_29" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_30" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_31" edc:desc="Divider ratio 1:65536; software control of WDTPS" edc:when="(field &amp; 0x1f) == 0x1f"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTE" edc:desc="WDT operating mode" edc:mask="0x3" edc:name="WDTE" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT Disabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SWDTEN" edc:desc="WDT enabled/disabled by SWDTEN bit" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="NSLEEP" edc:desc="WDT disabled in sleep, enabled when not in sleep" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT always enabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--nnnnnn" edc:cname="CONFIG3H" edc:desc="" edc:factorydefault="0xFF" edc:impl="0x3f" edc:name="CONFIG3H" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x3F" edc:default="0xFF" edc:_addr="0x300005">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTCWS" edc:desc="WDT Window Select bits" edc:mask="0x7" edc:name="WDTCWS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="WDTCWS_0" edc:desc="window delay = 87.5 % of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_1" edc:desc="window delay = 75 % of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_2" edc:desc="window delay = 62.5 % of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_3" edc:desc="window delay = 50 % of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_4" edc:desc="window delay = 37.5 % of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_5" edc:desc="window delay = 25 % of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_6" edc:desc="window always open (100%); no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_7" edc:desc="window always open (100%); software control; keyed access not required" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTCCS" edc:desc="WDT input clock selector" edc:mask="0x7" edc:name="WDTCCS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="HFINTOSC" edc:desc="WDT reference clock is the 31.25 kHz MFINTOSC output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LFINTOSC" edc:desc="WDT reference clock is the 31.0 kHz LFINTOSC" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SC" edc:desc="Software Control" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
