garyPenhook/PIC-Assembler/edc/PIC18F24Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T2INPPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T2INPPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xEA6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2INPPS0" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS1" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS2" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS3" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS4" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2INPPS" edc:mask="0x1f" edc:name="T2INPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T4INPPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T4INPPS" edc:nzwidth="8" edc:por="---10101" edc:_addr="0xEA7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4INPPS0" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS1" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS2" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS3" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS4" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4INPPS" edc:mask="0x1f" edc:name="T4INPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T6INPPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T6INPPS" edc:nzwidth="8" edc:por="---01111" edc:_addr="0xEA8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6INPPS0" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS1" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS2" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS3" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS4" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6INPPS" edc:mask="0x1f" edc:name="T6INPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADACTPPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ADACTPPS" edc:nzwidth="8" edc:por="---01100" edc:_addr="0xEA9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACTPPS0" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS1" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS2" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS3" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS4" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADACTPPS" edc:mask="0x1f" edc:name="ADACTPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CCP1PPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CCP1PPS" edc:nzwidth="8" edc:por="---10010" edc:_addr="0xEAA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1PPS0" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS1" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS2" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS3" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS4" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1PPS" edc:mask="0x1f" edc:name="CCP1PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
