garyPenhook/PIC-Assembler/edc/PIC18F24Q10.PIC
        <edc:SFRDef edc:access="nn----nn" edc:cname="PIE2" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="PIE2" edc:nzwidth="8" edc:por="00----00" edc:_addr="0xEBF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1IE" edc:mask="0x1" edc:name="C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IE" edc:mask="0x1" edc:name="C2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ZCDIE" edc:mask="0x1" edc:name="ZCDIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIE" edc:mask="0x1" edc:name="HLVDIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn--nn" edc:cname="PIE3" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00--00" edc:name="PIE3" edc:nzwidth="8" edc:por="--00--00" edc:_addr="0xEC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPIE" edc:mask="0x1" edc:name="SSPIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCLIE" edc:mask="0x1" edc:name="BCLIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TXIE" edc:mask="0x1" edc:name="TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIE" edc:mask="0x1" edc:name="RCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSP1IE" edc:mask="0x1" edc:name="SSP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCL1IE" edc:mask="0x1" edc:name="BCL1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TX1IE" edc:mask="0x1" edc:name="TX1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1IE" edc:mask="0x1" edc:name="RC1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PIE4" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PIE4" edc:nzwidth="8" edc:por="--000000" edc:_addr="0xEC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3IE" edc:mask="0x1" edc:name="TMR3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IE" edc:mask="0x1" edc:name="TMR4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IE" edc:mask="0x1" edc:name="TMR5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IE" edc:mask="0x1" edc:name="TMR6IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PIE5" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PIE5" edc:nzwidth="8" edc:por="-----000" edc:_addr="0xEC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIE" edc:mask="0x1" edc:name="TMR3GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIE" edc:mask="0x1" edc:name="TMR5GIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PIE6" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PIE6" edc:nzwidth="8" edc:por="------00" edc:_addr="0xEC3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IE" edc:mask="0x1" edc:name="CCP2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn----n" edc:cname="PIE7" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----0" edc:name="PIE7" edc:nzwidth="8" edc:por="000----0" edc:_addr="0xEC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CWGIE" edc:mask="0x1" edc:name="CWGIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="NVMIE" edc:mask="0x1" edc:name="NVMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIE" edc:mask="0x1" edc:name="CRCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIE" edc:mask="0x1" edc:name="SCANIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1IE" edc:mask="0x1" edc:name="CWG1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nr-nnn" edc:cname="PIR0" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00-000" edc:name="PIR0" edc:nzwidth="8" edc:por="--00-000" edc:_addr="0xEC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IF" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IF" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2IF" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCIF" edc:mask="0x1" edc:name="IOCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IF" edc:mask="0x1" edc:name="TMR0IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="PIR1" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="PIR1" edc:nzwidth="8" edc:por="00----00" edc:_addr="0xEC6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADIF" edc:mask="0x1" edc:name="ADIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADTIF" edc:mask="0x1" edc:name="ADTIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CSWIF" edc:mask="0x1" edc:name="CSWIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSCFIF" edc:mask="0x1" edc:name="OSCFIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="PIR2" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="PIR2" edc:nzwidth="8" edc:por="00----00" edc:_addr="0xEC7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1IF" edc:mask="0x1" edc:name="C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IF" edc:mask="0x1" edc:name="C2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ZCDIF" edc:mask="0x1" edc:name="ZCDIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIF" edc:mask="0x1" edc:name="HLVDIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
