garyPenhook/PIC-Assembler/edc/PIC18F24Q10.PIC
        <edc:SFRDef edc:access="--rr--nn" edc:cname="PIR3" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00--00" edc:name="PIR3" edc:nzwidth="8" edc:por="--00--00" edc:_addr="0xEC8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPIF" edc:mask="0x1" edc:name="SSPIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCLIF" edc:mask="0x1" edc:name="BCLIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TXIF" edc:mask="0x1" edc:name="TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIF" edc:mask="0x1" edc:name="RCIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSP1IF" edc:mask="0x1" edc:name="SSP1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCL1IF" edc:mask="0x1" edc:name="BCL1IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TX1IF" edc:mask="0x1" edc:name="TX1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1IF" edc:mask="0x1" edc:name="RC1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PIR4" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PIR4" edc:nzwidth="8" edc:por="--000000" edc:_addr="0xEC9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IF" edc:mask="0x1" edc:name="TMR1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IF" edc:mask="0x1" edc:name="TMR2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3IF" edc:mask="0x1" edc:name="TMR3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IF" edc:mask="0x1" edc:name="TMR4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IF" edc:mask="0x1" edc:name="TMR5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IF" edc:mask="0x1" edc:name="TMR6IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PIR5" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PIR5" edc:nzwidth="8" edc:por="-----000" edc:_addr="0xECA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1GIF" edc:mask="0x1" edc:name="TMR1GIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIF" edc:mask="0x1" edc:name="TMR3GIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIF" edc:mask="0x1" edc:name="TMR5GIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PIR6" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PIR6" edc:nzwidth="8" edc:por="------00" edc:_addr="0xECB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1IF" edc:mask="0x1" edc:name="CCP1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IF" edc:mask="0x1" edc:name="CCP2IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn----n" edc:cname="PIR7" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----0" edc:name="PIR7" edc:nzwidth="8" edc:por="000----0" edc:_addr="0xECC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CWGIF" edc:mask="0x1" edc:name="CWGIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="NVMIF" edc:mask="0x1" edc:name="NVMIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIF" edc:mask="0x1" edc:name="CRCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIF" edc:mask="0x1" edc:name="SCANIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1IF" edc:mask="0x1" edc:name="CWG1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WDTCON0" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--qqqqq0" edc:name="WDTCON0" edc:nzwidth="8" edc:por="--qqqqq0" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xECD">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTSEN" edc:desc="" edc:mask="0x1" edc:name="WDTSEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS0" edc:desc="" edc:mask="0x1" edc:name="WDTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS1" edc:desc="" edc:mask="0x1" edc:name="WDTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS2" edc:desc="" edc:mask="0x1" edc:name="WDTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS3" edc:desc="" edc:mask="0x1" edc:name="WDTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS4" edc:desc="" edc:mask="0x1" edc:name="WDTPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="WDTCON1" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-qqq-qqq" edc:name="WDTCON1" edc:nzwidth="8" edc:por="-qqq-qqq" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xECE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WINDOW" edc:desc="" edc:mask="0x7" edc:name="WINDOW" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS" edc:desc="" edc:mask="0x7" edc:name="WDTCS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WINDOW0" edc:desc="" edc:mask="0x1" edc:name="WINDOW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WINDOW1" edc:desc="" edc:mask="0x1" edc:name="WINDOW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WINDOW2" edc:desc="" edc:mask="0x1" edc:name="WINDOW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTWINDOW" edc:desc="" edc:mask="0x7" edc:name="WDTWINDOW" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="WDTWINDOW0" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTWINDOW1" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTWINDOW2" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS0" edc:desc="" edc:mask="0x1" edc:name="WDTCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS1" edc:desc="" edc:mask="0x1" edc:name="WDTCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS2" edc:desc="" edc:mask="0x1" edc:name="WDTCS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTPSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTPSL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xECF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSCNT" edc:desc="" edc:mask="0xff" edc:name="PSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSCNT0" edc:desc="" edc:mask="0x1" edc:name="PSCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT1" edc:desc="" edc:mask="0x1" edc:name="PSCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT2" edc:desc="" edc:mask="0x1" edc:name="PSCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT3" edc:desc="" edc:mask="0x1" edc:name="PSCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT4" edc:desc="" edc:mask="0x1" edc:name="PSCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT5" edc:desc="" edc:mask="0x1" edc:name="PSCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT6" edc:desc="" edc:mask="0x1" edc:name="PSCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT7" edc:desc="" edc:mask="0x1" edc:name="PSCNT7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTPSCNT" edc:desc="" edc:mask="0xff" edc:name="WDTPSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="WDTPSCNT0" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT1" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT2" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT3" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT4" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT5" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT6" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT7" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
