garyPenhook/PIC-Assembler/edc/PIC18F24Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC4PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC4PPS0" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS1" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS2" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS3" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS4" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC5PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC5PPS0" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS1" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS2" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS3" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS4" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC6PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC6PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC6PPS0" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS1" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS2" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS3" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS4" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC7PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC7PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC7PPS0" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS1" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS2" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS3" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS4" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xEFA"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xF" edc:beginaddr="0xF00" edc:endaddr="0xF60" edc:regionid="sfr15">
        <edc:AdjustPoint edc:offset="0x5" edc:_addr="0xF00"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF05">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF6" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF7" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAN" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF06">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN6" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN7" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAP" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF07">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAP0" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP1" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP2" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP3" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP4" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP5" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP6" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP7" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
