garyPenhook/PIC-Assembler/edc/PIC18F24Q10.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADSTPTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADSTPTH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF64">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADSTPTH" edc:desc="" edc:mask="0xff" edc:name="ADSTPTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADSTPT8" edc:desc="" edc:mask="0x1" edc:name="ADSTPT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT9" edc:desc="" edc:mask="0x1" edc:name="ADSTPT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT10" edc:desc="" edc:mask="0x1" edc:name="ADSTPT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT11" edc:desc="" edc:mask="0x1" edc:name="ADSTPT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT12" edc:desc="" edc:mask="0x1" edc:name="ADSTPT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT13" edc:desc="" edc:mask="0x1" edc:name="ADSTPT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT14" edc:desc="" edc:mask="0x1" edc:name="ADSTPT14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT15" edc:desc="" edc:mask="0x1" edc:name="ADSTPT15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADLTH" edc:desc="" edc:name="ADLTH" edc:nzwidth="0x10" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF65">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADLTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADLTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF65">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADLTHL" edc:desc="" edc:mask="0xff" edc:name="ADLTHL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADLTH0" edc:desc="" edc:mask="0x1" edc:name="ADLTH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH1" edc:desc="" edc:mask="0x1" edc:name="ADLTH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH2" edc:desc="" edc:mask="0x1" edc:name="ADLTH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH3" edc:desc="" edc:mask="0x1" edc:name="ADLTH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH4" edc:desc="" edc:mask="0x1" edc:name="ADLTH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH5" edc:desc="" edc:mask="0x1" edc:name="ADLTH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH6" edc:desc="" edc:mask="0x1" edc:name="ADLTH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH7" edc:desc="" edc:mask="0x1" edc:name="ADLTH7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADLTHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADLTHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF66">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADLTHH" edc:desc="" edc:mask="0xff" edc:name="ADLTHH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADLTH8" edc:desc="" edc:mask="0x1" edc:name="ADLTH8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH9" edc:desc="" edc:mask="0x1" edc:name="ADLTH9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH10" edc:desc="" edc:mask="0x1" edc:name="ADLTH10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH11" edc:desc="" edc:mask="0x1" edc:name="ADLTH11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH12" edc:desc="" edc:mask="0x1" edc:name="ADLTH12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH13" edc:desc="" edc:mask="0x1" edc:name="ADLTH13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH14" edc:desc="" edc:mask="0x1" edc:name="ADLTH14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH15" edc:desc="" edc:mask="0x1" edc:name="ADLTH15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADUTH" edc:desc="" edc:name="ADUTH" edc:nzwidth="0x10" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF67">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADUTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADUTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF67">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADUTHL" edc:desc="" edc:mask="0xff" edc:name="ADUTHL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADUTH0" edc:desc="" edc:mask="0x1" edc:name="ADUTH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH1" edc:desc="" edc:mask="0x1" edc:name="ADUTH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH2" edc:desc="" edc:mask="0x1" edc:name="ADUTH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH3" edc:desc="" edc:mask="0x1" edc:name="ADUTH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH4" edc:desc="" edc:mask="0x1" edc:name="ADUTH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH5" edc:desc="" edc:mask="0x1" edc:name="ADUTH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH6" edc:desc="" edc:mask="0x1" edc:name="ADUTH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH7" edc:desc="" edc:mask="0x1" edc:name="ADUTH7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADUTHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADUTHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF68">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADUTHH" edc:desc="" edc:mask="0xff" edc:name="ADUTHH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADUTH8" edc:desc="" edc:mask="0x1" edc:name="ADUTH8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH9" edc:desc="" edc:mask="0x1" edc:name="ADUTH9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH10" edc:desc="" edc:mask="0x1" edc:name="ADUTH10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH11" edc:desc="" edc:mask="0x1" edc:name="ADUTH11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH12" edc:desc="" edc:mask="0x1" edc:name="ADUTH12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH13" edc:desc="" edc:mask="0x1" edc:name="ADUTH13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH14" edc:desc="" edc:mask="0x1" edc:name="ADUTH14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH15" edc:desc="" edc:mask="0x1" edc:name="ADUTH15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
